"""
1.昨日内容回顾:
    Python简介:
        动态的解释性的弱类型语言
    变量
        保存程序中的中间值,供后续使用
        规范:
            1.包含数字/字母/下划线, 不能使用数字开头
            2.不能使用关键字
            3.不要太长,不要使用中文
            4.首字母小写驼峰式命名法
            5.全小写下划线命名法
    数据类型
        数字类型
        布尔类型
        字符串类型
    交互
        input()
        类型转换
    if
        1.if 条件:
            代码块
        2.if 条件:
            代码块
          else:
            代码块
        3.if 条件1:
            代码块1
          elif 条件2:
            代码块2
          ....
          else:
            代码块n
        4.嵌套if-elif-else
2.作业
3.今日主要内容
    1.while循环
    2.运算符
    3.编码
    
        
"""